{
  "profiles": [
    {
      "first_name": "Deniz",
      "last_name": "Can",
      "tc_no": "33344455566",
      "birth_date": "1988-11-01",
      "gender": "Kadın",
      "address": "İzmir, Bornova, Üniversite Cad. No: 15"
    },
    {
      "first_name": "Emre",
      "last_name": "Saygı",
      "tc_no": "77788899900",
      "birth_date": "1995-02-28",
      "gender": "Erkek",
      "address": "Bursa, Nilüfer, Özlüce Mah. Çiçek Sk. No: 3"
    }
  ],
  "doctors": [
    {
      "name": "Selin Pekel",
      "diploma_no": "98765",
      "branch": "Dermatoloji"
    },
    {
      "name": "Murat Erdem",
      "diploma_no": "11223",
      "branch": "Göğüs Hastalıkları"
    },
    {
      "name": "Aslı Yılmaz",
      "diploma_no": "54321",
      "branch": "Psikiyatri"
    }
  ],
  "diagnoses": [
    {
      "code": "J45.9",
      "description": "Astım, belirtilmemiş"
    },
    {
      "code": "L20.9",
      "description": "Atopik dermatit, belirtilmemiş"
    },
    {
      "code": "F41.1",
      "description": "Yaygın anksiyete bozukluğu"
    },
    {
      "code": "R05",
      "description": "Öksürük"
    },
    {
      "code": "H10.1",
      "description": "Akut atopik konjonktivit"
    }
  ],
  "medications": [
    {
      "name": "VENTOLİN İNHALER (100 mcg/doz) 200 DOZ",
      "barcode": "8699501090012",
      "dosage": "2 puf x 3",
      "period": "Günde",
      "amount": 6.0,
      "unit": "PUF"
    },
    {
      "name": "DERMOVATE %0.05 KREM 25 GR",
      "barcode": "8699532350020",
      "dosage": "1",
      "period": "Günde",
      "amount": 1.0,
      "unit": "KREM"
    },
    {
      "name": "XANAX 0.5 MG TB",
      "barcode": "8699540090010",
      "dosage": "0.5",
      "period": "Günde",
      "amount": 0.5,
      "unit": "TB"
    },
    {
      "name": "CETRİN 10 MG TB",
      "barcode": "8699525090011",
      "dosage": "1",
      "period": "Günde",
      "amount": 1.0,
      "unit": "TB"
    },
    {
      "name": "PULMİCORT TURBUHALER 200 MCG",
      "barcode": "8699512345678",
      "dosage": "1 puf x 2",
      "period": "Günde",
      "amount": 2.0,
      "unit": "PUF"
    },
    {
      "name": "FUCİDİN KREM",
      "barcode": "8699516350010",
      "dosage": "1",
      "period": "Günde",
      "amount": 1.0,
      "unit": "KREM"
    },
    {
      "name": "CONJUNCADİN GÖZ DAMLASI",
      "barcode": "8699507890012",
      "dosage": "2 damla x 2",
      "period": "Günde",
      "amount": 4.0,
      "unit": "DAMLA"
    }
  ],
  "prescriptions": [
    {
      "profile_tc_no": "33344455566",
      "doctor_diploma_no": "11223",
      "date": "2025-07-10",
      "protocol_no": "20250710001",
      "provision_type": "Normal",
      "prescription_type": "Normal",
      "prescription_subtype": "Ayaktan",
      "icd10_codes": [
        "J45.9",
        "R05",
        "H10.1"
      ],
      "medications": [
        "8699501090012",
        "8699525090011",
        "8699507890012"
      ],
      "remarks": "Astım ve ilişkili semptomlar için reçete edildi.",
      "is_latest": true
    },
    {
      "profile_tc_no": "77788899900",
      "doctor_diploma_no": "98765",
      "date": "2025-07-12",
      "protocol_no": "20250712002",
      "provision_type": "Normal",
      "prescription_type": "Normal",
      "prescription_subtype": "Ayaktan",
      "icd10_codes": [
        "L20.9",
        "F41.1"
      ],
      "medications": [
        "8699532350020",
        "8699540090010",
        "8699516350010"
      ],
      "remarks": "Dermatit ve anksiyete şikayetleri için reçete edildi.",
      "is_latest": true
    }
  ],
  "medical_histories": [
    {
      "profile_tc_no": "33344455566",
      "description": "Hasta, son üç aydır özellikle gece ve sabahın erken saatlerinde artan, kuru ve inatçı öksürük, nefes darlığı ve göğüste sıkışma şikayetleriyle başvurdu. Ayrıca mevsim geçişlerinde gözlerinde kaşıntı ve kızarıklık, burun akıntısı gibi alerjik semptomlar da eşlik etmekteydi. Öyküsünde çocukluk çağında sık bronşit geçirdiği ve ailesinde astım öyküsü olduğu öğrenildi. Fizik muayenede solunum seslerinde yer yer hırıltılar duyuldu. Solunum fonksiyon testleri (SFT) yapıldı ve önemli ölçüde hava akımı kısıtlılığı ile birlikte bronkodilatör sonrası reversibilite saptandı. Kan testlerinde eozinofili ve total IgE yüksekliği gözlendi. Bu bulgular doğrultusunda Astım (J45.9), Akut Atopik Konjonktivit (H10.1) ve Öksürük (R05) tanısı konuldu. Tedaviye inhale kortikosteroid (PULMİCORT), kısa etkili beta-2 agonist (VENTOLİN) ve oral antihistaminik (CETRİN) ile başlandı. Hastanın şikayetlerinin yaşam kalitesini ciddi şekilde etkilediği, uyku düzeninin bozulduğu ve günlük aktivitelerinde kısıtlamalar yaşadığı belirtildi. Hasta eğitimi, tetikleyicilerden kaçınma yöntemleri ve acil durum eylem planı hakkında detaylı bilgi verildi. Düzenli takip randevuları planlandı.",
      "date": "2025-07-08"
    },
    {
      "profile_tc_no": "77788899900",
      "description": "Hasta, yaklaşık beş aydır devam eden, özellikle geceleri şiddetlenen ve uykusunu bölen yoğun kaşıntı ve ciltte kızarıklık şikayetleriyle dermatoloji kliniğine başvurdu. Lezyonlar genellikle dirsek içleri, diz arkaları ve boyun bölgesinde yerleşimliydi ve tekrarlayan çizilmeye bağlı ikincil enfeksiyon belirtileri de mevcuttu. Hastanın stresli dönemlerde semptomlarının arttığını, işyerindeki yoğunluğun ve özel hayatındaki bazı sıkıntıların kaşıntısını tetiklediğini ifade etti. Daha önce eczaneden temin ettiği çeşitli kremler ve nemlendiriciler kullanmış ancak geçici rahatlama sağlamıştı. Fizik muayenede tipik atopik dermatit lezyonları, likenifikasyon ve yer yer ekskoriasyonlar gözlendi. Yapılan rutin kan testleri normal sınırlardaydı. Atopik dermatit (L20.9) tanısı konuldu. Hastanın ayrıca son altı aydır devam eden, uykuya dalmada güçlük, sürekli endişe hali, huzursuzluk ve konsantrasyon güçlüğü gibi belirtilerle kendini gösteren yaygın anksiyete bozukluğu (F41.1) tanısı da mevcuttu. Bu anksiyetenin, cilt şikayetlerini artırıcı bir faktör olduğu düşünülüyordu. Tedaviye topikal kortikosteroid (DERMOVATE), antibakteriyel krem (FUCİDİN) ve anksiyete için benzodiazepin (XANAX) ile başlandı. Hastaya cilt bakımı rutinleri, tetikleyicilerden kaçınma ve stres yönetimi teknikleri hakkında bilgi verildi. Psikiyatri ile konsültasyon ve psikoterapi desteği de planlandı. Hastanın genel yaşam kalitesinin hem fiziksel hem de psikolojik olarak etkilendiği, sosyal aktivitelerden uzaklaştığı ve özgüveninde düşüş yaşadığı belirtildi.",
      "date": "2025-07-11"
    }
  ],
  "reports": [
    {
      "profile_tc_no": "33344455566",
      "title": "Solunum Fonksiyon Testi ve Allerji Testi Raporu",
      "content": "FVC: 3.5 L (%90), FEV1: 2.8 L (%85), FEV1/FVC: 80%. Bronkodilatör sonrası FEV1 %15 artış gösterdi. Allerji deri prick testinde ev tozu akarı ve polenlere karşı pozitif reaksiyon saptandı. Bulgular astım ve alerjik yapıyı desteklemektedir.",
      "date": "2025-07-09",
      "report_code": "RPT003"
    },
    {
      "profile_tc_no": "77788899900",
      "title": "Dermatoloji ve Psikiyatri Değerlendirme Raporu",
      "content": "Hasta cildindeki kaşıntı ve kızarıklık şikayetleri ile başvurdu. Muayenede yaygın atopik dermatit lezyonları görüldü. Hastanın bildirdiği anksiyete şikayetleri üzerine yapılan psikiyatrik değerlendirmede yaygın anksiyete bozukluğu tanısı konuldu. Tedavi planı topikal kortikosteroid, antibakteriyel krem ve anksiyolitik içerir. Psikoterapiye başlanması önerildi.",
      "date": "2025-07-11",
      "report_code": "RPT004"
    }
  ]
}